
/* =========================================================================================
 * Import Packages
 * ========================================================================================= */

import { Component, ViewChild } from '@angular/core';
import { Nav, Platform } from 'ionic-angular';

/* =========================================================================================
 * Ionic Native
 * ========================================================================================= */

import { StatusBar } from '@ionic-native/status-bar';
import { SplashScreen } from '@ionic-native/splash-screen';

/* =========================================================================================
 * Setting
 * ========================================================================================= */

import { AppSetting } from '../common/app.setting';

/* =========================================================================================
 * Pages
 * ========================================================================================= */

import { MainNav } from '../pages/main/nav';

/* =========================================================================================
 * Component
 * ========================================================================================= */

@Component({
    templateUrl: 'app.html'
})

/* =========================================================================================
 * Class
 * ========================================================================================= */

export class MyApp {

    // หน้าแรก (ของแอพ)
    public rootPage: any = MainNav; 

    /* =========================================================================================
     * Constructor
     * ========================================================================================= */
  
    // ทำงานอัตโนมัติ
    public constructor (
        public platform: Platform, 
        public statusBar: StatusBar, 
        public splashScreen: SplashScreen, 
        public app: AppSetting) {

        // เริ่มต้น    
        this.initializeApp();

    }

    // เริ่มต้น
    public initializeApp () {
        this.platform.ready().then(() => {
            this.statusBar.styleDefault();
            this.splashScreen.hide(); // ปิด Splash Screen หลังโหลดเสร็จ
        });
    }

}